docs(contributing): change dependencies graph to mermaid (#6901)
